#include <stdio.h>
/*********************************
* 方法1: 第一维的长度可以不指定
*        但必须指定第二维的长度
*********************************/
void print_a(int a[][5], int n, int m) {
	int i, j;
	for (i = 0; i < n; i++) {
		for (j = 0; j < m; j++)
			printf("%d ", a[i][j]);
		printf("\n");
	}
}

/*****************************************
* 方法2: 指向一个有5个元素一维数组的指针
(*a)[5]代表指向一个有5个元素一维数组的指针,本质是指针,所以可以进行加法运算
至于把他发展成a[i][j]只是对指针的处理,至于是不是存在,指针数据可不管了
二维数组a[2][3]至于第二行是不是有三个值不重要,因为他一样会当成三个地址来存储
（*a）先是指向地址，然后地址是一个5个元素的数组  这叫数组的指针

*****************************************/
void print_b(int(*a)[5], int n, int m) {
	int i, j;
	for (i = 0; i < n; i++) {
		for (j = 0; j < m; j++)
			printf("%d ", a[i][j]);
		printf("\n");
	}
}

/***********************************
* 方法3: 利用数组是顺序存储的特性,
*       通过降维来访问原数组!
***********************************/
void print_c(int* a, int n, int m) {
	int i, j;
	for (i = 0; i < n; i++) {
		for (j = 0; j < m; j++)
			printf("%d ", *(a + i * m + j));
		printf("\n");
	}
}
int main(void)
{
	int a[5][5] = { {1, 2}, {3, 4, 5}, {6}, {7}, {0, 8} };

	printf("\n方法1:\n");
	print_a(a, 5, 5);

	printf("\n方法2:\n");
	print_b(a, 5, 5);

	printf("\n方法3:\n");
	print_c(&a[0][0], 5, 5);

	//    getch(); 
	return 0;
}